<a href="https://colab.research.google.com/github/rtxverma123/Python/blob/main/Pandas_Data_Frames-1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import numpy as np
import pandas as pd
from numpy.random import randn

**Data Frames**

In [8]:
np.random.seed(101)

In [9]:
data = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])
data
#a,b,c,d are rows and w,x,y,z are coloumns

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**Getting a series in DataFrame**

In [10]:
data['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

**Multiple Column**

In [11]:
data[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

New Coloumn

In [19]:
data['new'] = data['W']+data['Z']
data

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

Remove Coloumn

In [20]:
data.drop('new',axis=1,inplace=True) #inplace is required otherwise data will not be removed permanently
#Axis is 1 for choosing via coloumns(By default it is set to row)

In [21]:
data

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
data.drop('E') #Here axis is not required coz for default drop by row is initialised.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

Select Coloumn

In [23]:
data[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

Select Row

In [24]:
data.iloc[3] #d is at third position starting from 0 at A

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [25]:
data.loc['B','Y']

-0.8480769834036315

Subset of Rows and Coloumns

In [26]:
data.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

**Conditional DataFrame**

In [28]:
booldf = data>0

In [29]:
data[booldf] #Returns only those values that are greater than zero

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
data['W']>0 #Returns coloumn values greater than zero

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [31]:
data[data['W']>0] #Conditional Selection

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
data

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
data[data['Z']<0] #Returns only the value where z<0 and we are asking entire data frame so it will return corresponding to it

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [36]:
#Return a conditional coloumn and over that get any particular coloumn
resData = data[data['W']>0]
resData['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [ ]:
data[data['W']>0]['X'] #Above things in one line

**Multiple Conditions**

In [37]:
data[(data['W']>0) & (data['Y']>1)] #dont use and here coz and works on single values and tabular values

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [38]:
data[(data['W']>0) | (data['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
data.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

**Adding New Coloum Values**

In [41]:
newind = 'CA NY WY OR CO'.split() #Conversion from string to list

In [44]:
data['States']=newind
data

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

**Setting Values of New Coloumn as Index**

In [45]:
data.set_index('States') #This will set any coloumn as an index for the table
#For permanent as always inplace=True has to be set

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509